[
  {
    "id": "-6US1xKg",
    "lastModified": "2016-05-07T08:10:08.835Z",
    "names": [
      "Cauliflower"
    ],
    "description": "Use them raw as crudites, or make curries, soups, casseroles, fritters and more with this delicious vegetable. \n\nBuy fresh, heavy one with clean white surfaces. Generally, the green parts are discarded.\n\nUnless you are making soups, always cut into florets instead of just chopping them up. They will look and cook better. Wash thoroughly before use. The best way is to put the florets in a large bowl with 1 cup of water and half a teaspoon of salt, cover with cling wrap and microwave for 2 minutes. Drain the water.\n\nStore whole cauliflowers wrapped in plastic in the refrigerator for up to a week. You can also cut into florets and store in an airtight container. The florets can also be frozen but be sure to thaw them out in the refrigerator before use",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "-GB41Pde",
    "lastModified": "2016-05-07T12:31:14.15Z",
    "names": [
      "Turmeric"
    ],
    "vegan": true
  },
  {
    "id": "1Af_VldR",
    "lastModified": "2016-05-07T08:15:53.777Z",
    "names": [
      "Asam Jawa",
      "Indian Date",
      "Tamarind"
    ],
    "description": "Refers to the pulp extracted from the tamarind pod. It is used as a souring agent in several cuisines. \n\nAvoid buying ready to use tamarind paste or juice sold in supermarkets. Cheaper, longer-lasting and much more flavourful bricks of the pulp are sold in Indian grocery stores. Soak small amount of the pulp in warm water and squeeze out the juice whenever needed. Store tamarind in an airtight container in the pantry in a cool, dark place. It will last for several months, even a year. \n\nMeasurements in the recipes are given in grams of pulp that will need to be soaked.",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "4qfpoFAN",
    "lastModified": "2016-05-07T08:11:40.46Z",
    "names": [
      "Fenugreek Seeds",
      "Methi Dana"
    ],
    "description": "Small, yellow-brown coloured, with a strong bitter taste, these seeds are added to curries, chutneys, stews and sauces. You can find them in Indian or Middle-Eastern grocery stores as seeds or powder. You can also make the powder at home by simply toasting the seeds and grinding them. \n\nBoth the seeds and powder store well in the pantry, although the powder loses its potency quickly.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "7lZzLbgx",
    "lastModified": "2016-05-07T08:15:10.698Z",
    "names": [
      "Sesame Seeds",
      "White Sesame Seeds"
    ],
    "description": "Refers to the white seeds, unless specified otherwise. The seeds have a nutty flavour and are best when toasted before use. Commonly used in Indian, Asian and Middle-Eastern cuisine or sprinkled on baked goods. \n\nBuy from local supermarkets or get them for less in Asian, Indian or Middle-Eastern grocery stores. Store in an airtight container in a cool, dark place.",
    "category": "Legumes, Nuts and Seeds",
    "vegan": true
  },
  {
    "id": "AqWMlkGo",
    "lastModified": "2016-05-07T08:12:01.164Z",
    "names": [
      "Fresh Mint",
      "Mint Leaves",
      "Pudina"
    ],
    "description": "Used in cuisines around the world to bring freshness to dishes. They are generally added towards the end of the cooking process or even after. \n\nSold in bunches in most markets, they spoil very quickly. Store in the refrigerator, wrapped in paper towels and use within a few days. They will last longer if you pick the leaves and store in a container lined with paper towels. You can also crush them with some oil and freeze in ice trays for later use.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "b6ldX3JK",
    "lastModified": "2016-05-07T08:12:15.051Z",
    "names": [
      "Garlic"
    ],
    "description": "The most common garlic is white-skinned and quite pungent. There are other varieties - mild green or purple-skinned. Buy raw and whole, unless there is a specific need for other types.  \n\nStore in a dry, cool place in your pantry and it will last for several weeks. There is no need to refrigerate garlic. ",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "bNGLFPl0",
    "lastModified": "2016-05-07T08:13:45.027Z",
    "names": [
      "Nutmeg"
    ],
    "description": "Usually used in powdered form, you can also buy whole nutmegs and grate them just before use. \n\nUsed in several cuisines, you can buy them in Indian, Middle-Eastern or Asian stores as well as local supermarkets. Store them in a cool, dry place. Use an airtight container if you buy the powdered form. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "bsSuyXu6",
    "lastModified": "2016-05-07T08:14:23.579Z",
    "names": [
      "Long White Potato",
      "Potato"
    ],
    "description": "A very versatile and popular vegetable, potatoes can be boiled, roasted, steamed, roasted, baked, fried or used to thicken and add bulk to soups, stews and curries. They can be used peeled or unpeeled. \n\nSeveral varieties are available - baby potatoes, finger potatoes, purple or red potatoes and so on. In most recipes, use a generic version unless otherwise specified.\n\nStore them in the pantry in a cool, dark and dry place and they will last for at least a month. Don't refrigerate",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "bVx2xwma",
    "lastModified": "2016-05-07T08:14:06.18Z",
    "names": [
      "Groundnuts",
      "Peanuts"
    ],
    "description": "These are extremely popular and cheap and can be bought shelled or unshelled. Unshelled peanuts are boiled in salted water or toasted and eaten as a snack. \n\nMost recipes use shelled peanuts. They can be bought in supermarkets raw or roasted, salted or unsalted. If you need crushed or ground peanuts for your dish, make sure you toast them first. ",
    "category": "Legumes, Nuts and Seeds",
    "vegan": true
  },
  {
    "id": "c0STLmcq",
    "lastModified": "2016-05-07T08:12:30.322Z",
    "names": [
      "Elaichi",
      "Green Cardamom"
    ],
    "description": "Refers to whole cardamom pods containing the seeds. They are generally used whole to flavour curries and rice dishes. The pods are discarded once the dish is done. \n\nYou can also use ground cardamom seeds, available in stores as ground cardamom. It is best to make your own though, as it is simply a matter of peeling off the skin of the pod and crushing the seeds. \n\nBuy from local Indian or Middle-Eastern grocery stores and store in airtight containers in a cool place. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "DfgIn-bx",
    "lastModified": "2016-05-07T08:10:34.395Z",
    "names": [
      "Coriander Seeds",
      "Dhania"
    ],
    "description": "These are small, almost spherical, light brown seeds that are used in several cuisines around the world. Generally sold as whole seeds or in powdered form. Coriander seeds can be freshly ground at home for better flavour. Simply toast them and grind to a fine powder.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "fvr4vmad",
    "lastModified": "2016-05-07T08:11:11.394Z",
    "names": [
      "Dried Fenugreek Leaves",
      "Kasoori Methi"
    ],
    "description": "These leaves are used in Indian cooking mainly to enhance the flavour and aroma of curries. Buy from Indian grocery stores in small amounts. Can store in an airtight container for months. You can make your own by sun-drying fresh fenugreek leaves. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "g-KVLn0I",
    "lastModified": "2016-05-07T08:13:17.299Z",
    "names": [
      "Long-Grain Rice"
    ],
    "description": "As the name suggests, this rice is long. When cooked, it is generally fluffy and the grains stay separate. Examples include Basmati rice and Jasmine rice.\n\nStore rice in a cool, dry place. It will last for months, even years. ",
    "category": "Grains, Grain Products and Flours",
    "vegan": true
  },
  {
    "id": "gekWvr9Y",
    "lastModified": "2016-05-07T08:13:41.251Z",
    "names": [
      "Black Mustard Seeds",
      "Mustard Seeds"
    ],
    "description": "Refers to the black or brown mustard seeds usually found in Indian grocery stores. They are smaller and hotter than their yellow counterparts. \n\nBlack mustard seeds are an essential ingredient for 'tempering' Indian dishes. \n\nStore them in a cool, dry place in your pantry and they will last for several months.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "GW_XXZqX",
    "lastModified": "2016-05-07T08:12:34.34Z",
    "names": [
      "Fresh Peas",
      "Garden Peas",
      "Green Peas",
      "Shell Peas"
    ],
    "description": "You can buy them whole with their pods and shell them yourself. You can also buy them shelled, either fresh or frozen. You can also buy fresh and freeze the peas yourself. Remember that frozen peas cook a lot faster than fresh ones. \n\nRecipe measurements usually refer to the shelled peas, not the whole pods.",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "HILBuSz_",
    "lastModified": "2016-05-07T08:09:00.829Z",
    "names": [
      "Bay Leaf",
      "Indian Bay Leaf"
    ],
    "description": "Can be used fresh or dried, they give a woodsy flavour. Generally added whole, these leaves should be removed before serving the dish and discarded\n\nBuy dried leaves if you don't use them too often. You can buy them in supermarkets or maybe get them for less in Indian grocery stores",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "hr8-r0DU",
    "lastModified": "2016-05-07T08:10:51.753Z",
    "names": [
      "Curry Leaves",
      "Kari Patta",
      "Sweet Neem Leaves"
    ],
    "description": "Used mainly in the Indian subcontinent, these leaves are used as seasoning. They are generally fried in hot oil, although they can be ground up or dried and powdered as well. \n\nPick the leaves from the stalks and store in a freezer bag for months.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "IHF1u5S4",
    "lastModified": "2016-05-07T08:10:24.944Z",
    "names": [
      "Cloves"
    ],
    "description": "These are dark brown, flower buds shaped like nails. They have a sweet flavour, but can become quite overpowering if used in excess. Use them to spice up sauces, curries and fragrant rice dishes\n\nThey are available in most grocery stores. Buy small amounts and store in the pantry in a cool, dark place.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "JKsRsdaq",
    "lastModified": "2016-05-07T08:14:58.871Z",
    "names": [
      "Salt"
    ],
    "description": "Most recipes call for table salt, although there are several varieties - sea salt, kosher salt, rock salt and so on. In general, it doesn't matter which you use, unless the recipe specially needs a particular type.\n\nSalt can absorb moisture very quickly. Most table salt contains an anti-caking agent that prevents this, but it is best to store salt in airtight containers away from moisture. ",
    "category": "Condiments and Flavourings",
    "vegan": true
  },
  {
    "id": "jnZf_ewk",
    "lastModified": "2016-05-07T08:16:28.421Z",
    "names": [
      "Kas-Kas",
      "Khus-Khus",
      "White Poppy Seeds"
    ],
    "description": "Used in both sweet and savoury Indian dishes, white poppy seeds can be a thickening agent or a source of crunch. \n\nBuy from Indian grocery stores. They will last for several months or more when stored in an airtight container in the pantry. There is no need to refrigerate, but there is no harm either. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "kxHIX-LZ",
    "lastModified": "2016-05-07T08:09:13.062Z",
    "names": [
      "Black Cumin Seeds",
      "Royal Cumin Seeds",
      "Shah Jeera",
      "Shahi Jeera"
    ],
    "description": "Used mainly in North Indian cuisine, this spice is thinner, darker and sweeter than cumin seeds. You can find them in most Indian grocery stores. \n\nBuy in small amounts and store in a cool, dark place in a sealed container. To bring out the flavour of slightly old seeds, simply toast them until they are aromatic",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "Mqf6ueTW",
    "lastModified": "2016-05-07T08:11:10.305Z",
    "names": [
      "Dried Coconut"
    ],
    "description": "Dried coconut is sold as halves, grated or flaked. You can buy halves at grate them yourself. It is used in both sweet and savoury dishes and is an important ingredient in South Indian, Sri Lankan and Southeast Asian cuisines.\n\nDried coconut stores well in the pantry or refrigerator, but use within a few months",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "N2YXf2ns",
    "lastModified": "2016-05-07T08:11:26.651Z",
    "names": [
      "Aubergine",
      "Brinjal",
      "Eggplant"
    ],
    "description": "There are several varieties available, so buy based on the recipe. Bake, grill, fry, or saute them, but never eat them raw. Buy firm, fresh ones, with a shiny skin. Store them in the refrigerator for a few days. They will become soft and wrinkly quickly, so use as soon as you can. \n\nEggplants can sometimes be bitter, so some recipes call for peeling and salting the eggplant before cooking. ",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "nbfmHKxW",
    "lastModified": "2016-05-07T08:12:49.023Z",
    "names": [
      "Asafoetida",
      "Hing"
    ],
    "description": "This is a gum resin, that is sold as tiny dried pieces or more commonly in powdered form, which is slightly milder. It is used primarily in Indian dishes and imparts a unique flavour. Use very sparingly as it can completely overwhelm every other flavour.\n\nYou can find it in Indian grocery stores in small plastic bottles. Store covered or it will lose its potency. There is no need to refrigerate. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "NjTiracx",
    "lastModified": "2016-05-07T08:13:46.1Z",
    "names": [
      "Oil"
    ],
    "description": "Refers to any cooking oil, preferably one without a strong flavour. If using it for deep-frying, choose an oil that doesn't smoke too easily. \n\nStore oil in a cool, dark and dry place. Most commonly used oils store very well for several months, sometimes more than a year.",
    "category": "Oils and Sweeteners",
    "vegan": true
  },
  {
    "id": "pkodzwcN",
    "lastModified": "2016-05-07T08:12:32.169Z",
    "names": [
      "Green Chillies"
    ],
    "description": "There are several varieties of chillies around the world which vary in colour and intensity. Use small thai green chillies or thin and long green chillies. In general, the smaller or thinner the chilli, the hotter it will be. Remove seeds if you want less heat. \n\nAlthough a lot of recipes will ask for specific chillies, you can always interchange them with no big difference. But always make sure you use chillies with similar intensity.\n\nBe careful while handling chillies. The really hot ones can sting your skin. Use gloves if you can. Rub sugar between your hands to remove the sting. \n\nFresh, shiny, bright green chillies from the market can be stored in the refrigerator for 2 weeks. You can also store them in the freezer in small bags. Thaw them before use or simply grate the frozen chillies onto food for extra heat.",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "pUdoIzXE",
    "lastModified": "2016-05-07T08:09:21.851Z",
    "names": [
      "Black Pepper",
      "Black Peppercorns"
    ],
    "description": "Although whole peppercorns are used in some dishes for the spice, it is more common to grind them before use. You can buy ground black pepper, but it is ridiculously easy to grind whole peppercorns yourself. Ground pepper is also frequently used as seasoning\n",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "Q-k77C0c",
    "lastModified": "2016-05-07T08:13:30.654Z",
    "names": [
      "Milk"
    ],
    "description": "Refers to full cream milk, unless otherwise specified. Buy from supermarkets and store in the refrigerator and use before its use by date.",
    "category": "Dairy, Eggs and Non-dairy Cheeses",
    "vegan": false
  },
  {
    "id": "QBFdQgP0",
    "lastModified": "2016-05-07T08:10:03.32Z",
    "names": [
      "Carrot"
    ],
    "description": "A root vegetable that can add colour and sweetness to almost any dish, sweet or savoury. They are generally washed and peeled before use. You can leave the peels on but it can make the carrot go dark and lose that lovely bright orange colour.\n\nEat them whole and raw or in salads, juice them, blend into soups, add to stews, curries, pies or casseroles, make cakes, the possibilities are endless.\n\nBuy fresh and store in the refrigerator for about 2 weeks",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "slR9aCV6",
    "lastModified": "2016-05-07T08:14:57.771Z",
    "names": [
      "Saffron"
    ],
    "description": "This is possibly the most expensive spice in the world, but only a few strands are needed in most recipes. It is available as strands or in powdered form. It is best to buy the strands as they are less likely to be fake. Buy strands that are red with orange tips.\n\nSaffron powder can be added directly to dishes, while the strands have to be soaked in hot water or milk first. \n\nThey are available in most supermarkets, but you can get them for less in Middle-Eastern grocery stores. Buy in small quantities and store in an airtight container in your pantry. It will last for several months. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "Sn49NAnC",
    "lastModified": "2016-05-07T08:12:16.144Z",
    "names": [
      "Clarified Butter",
      "Ghee"
    ],
    "description": "Ghee is very commonly used in Indian cuisine. Buy from Indian grocery stores or make your own. \n\nHeat pure, unsalted butter till it melts completely. Continue heating, you will first see some foaming on top and eventually a browning residue at the bottom of the pan. Strain off and discard the residue and what you are left with is ghee. \n\nYou don't have to refrigerate ghee, although it makes no difference if you do. ",
    "category": "Dairy, Eggs and Non-dairy Cheeses",
    "vegan": false
  },
  {
    "id": "TobAHlmq",
    "lastModified": "2016-05-07T08:10:20.493Z",
    "names": [
      "Cinnamon"
    ],
    "description": "A very popular spice that is used in both sweet and savoury dishes. You can buy whole sticks or ground cinnamon. Either way they last for months in the pantry. Buy small quantities as most recipes call for just a teaspoon or two.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "u2teMhEi",
    "lastModified": "2016-05-07T08:16:44.72Z",
    "names": [
      "Curd",
      "Curds",
      "Yoghurt",
      "Yogurt"
    ],
    "description": "Yoghurt is made using milk and bacterial cultures that make it thick and tangy. Buy ready made from supermarkets. You can get plain or flavoured ones. \n\nIt is, however, very easy and cheap to make yoghurt yourself. You will need a small amount of yoghurt that contains active cultures. Look for yoghurt in the supermarket that specifically mentions these cultures. \n\nYou can use homemade yoghurt as the culture the next time you want to make more. Store it in the refrigerator or it will go sour. Use within a few days. \n",
    "category": "Dairy, Eggs and Non-dairy Cheeses",
    "vegan": false
  },
  {
    "id": "uB6jpbJQ",
    "lastModified": "2016-05-07T08:12:22.838Z",
    "names": [
      "Ginger-Garlic Paste"
    ],
    "description": "A simple blend of ginger and garlic, this paste is used predominantly in Indian cuisine. Sold in jars in Indian grocery stores, but you can make your own. Blend together equal amounts of ginger and garlic. You can use salt, vinegar or oil to make the blending easier. Never use water.\n\nStore in an airtight jar in the refrigerator. It will last for months, but slowly lose its potency. ",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "vXTpWf8f",
    "lastModified": "2016-05-07T08:15:47.529Z",
    "names": [
      "Golden Raisins",
      "Sultanas"
    ],
    "description": "Refers to any kind of dried grape including golden raisins, dark raisins or currants.\n\nBuy from local supermarkets and store them in the refrigerator. They will last for several months.",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "w6QRWRBb",
    "lastModified": "2016-05-07T08:12:18.019Z",
    "names": [
      "Adrak",
      "Fresh Ginger",
      "Ginger",
      "Gingerroot",
      "Khing",
      "Shoga"
    ],
    "description": "Ginger is a common ingredient in several cuisines. Buy raw and fresh ginger, unless you specifically need other types. Always wash and peel before use.\n\nStore unpeeled in a dry, cool place in your pantry if using within the week. Otherwise, store in a plastic bag in the refrigerator for a few weeks to a month ",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "wwlVWpHS",
    "lastModified": "2016-05-07T08:10:04.4Z",
    "names": [
      "Cashewnuts",
      "Cashews"
    ],
    "description": "These nuts are rich and sweet and have a lovely crunchy texture. Eat them raw, toasted, salted or coated in caramel. Use them to make dips, add crunch in salads and stir-fries or even grind them up for smooth creamy curries.\n\nCashews are generally quite expensive in regular supermarkets. Look for them in ",
    "category": "Legumes, Nuts and Seeds",
    "vegan": true
  },
  {
    "id": "ze-Wjp1J",
    "lastModified": "2016-05-07T08:12:23.89Z",
    "names": [
      "Green Beans",
      "Snap Beans",
      "String Beans"
    ],
    "description": "These are beans that are eaten with the enclosing pods. They can be steamed, boiled or stir-fried until tender. Some pods may have strings along the length that you will have to remove before cooking. \n\nBuy fresh, bright green beans from local markets. Store them in the refrigerator for up to a week or you can freeze them either whole or cut into 1\" lengths. ",
    "category": "Vegetables and Fruits",
    "vegan": true
  },
  {
    "id": "zNkkWf5S",
    "lastModified": "2016-05-07T08:11:54.258Z",
    "names": [
      "Cilantro",
      "Fresh Coriander"
    ],
    "description": "Used in cuisines around the world to bring freshness to dishes. They are generally added towards the end of the cooking process or even after. \n\nSold in bunches in most markets, they spoil very quickly. Store in the refrigerator, wrapped in paper towels and use within a few days. They will last longer if you pick the leaves and store in a container lined with paper towels. You can also crush them with some oil and freeze in ice trays for later use.",
    "category": "Herbs and Spices",
    "vegan": true
  },
  {
    "id": "_hfTfh3z",
    "lastModified": "2016-05-07T08:10:48.818Z",
    "names": [
      "Cumin Seeds",
      "Cummin",
      "Jeera"
    ],
    "description": "These are small, oblong, ridged, brown seeds that are used in several cuisines around the world. Generally sold as whole seeds or in powdered form. Cumin seeds can be freshly ground at home for better flavour. Simply toast them and grind to a fine powder.",
    "category": "Herbs and Spices",
    "vegan": true
  }
]